app/Http/Controllers/Auth/RegisterController.php

    protected function create(array $data)
    {
        $workspace = Workspace::create([
            'name' => 'My Workspace',
            'icon' => '🧪',
        ]);

        $user = User::create([
            'name' => $data['name'],
            'email' => strtolower($data['email']),
            'password' => bcrypt($data['password']),
            'hear_about_us' => $data['hear_about_us']
        ]);

        // Add relation with user
        $user->workspaces()->sync([
            $workspace->id => [
                'role' => 'admin'
            ]
        ], false);
---
INSERT INTO "workspaces" ("name", "icon", "updated_at", "created_at") VALUES ('My Workspace', '🧪', '2023-01-10 13:09:38', '2023-01-10 13:09:38') returning "id"
INSERT INTO "users" ("name", "email", "password", "hear_about_us", "updated_at", "created_at") VALUES ('Julien', 'julien@nahum.net', '$2y$10$J.mleh54pBunHYArMGOvX.ZmcuR.bgn5XhI4odCQy7w4.ZYjcSF5G', 'twitter', '2023-01-10 13:09:39', '2023-01-10 13:09:39') returning "id"
INSERT INTO "user_workspace" ("role", "user_id", "workspace_id") VALUES ('admin', 53, 42)