app/Service/SeoMetaResolver.php

SELECT * FROM "forms" WHERE "slug" = 'my-form' and "forms"."deleted_at" IS NULL LIMIT 1
---
    private function getFormShowMeta(): array
    {
        $form = Form::whereSlug($this->patternData['slug'])->firstOrFail();