app/Http/Resources/FormResource.php

SELECT "workspaces".*, "user_workspace"."user_id" as "pivot_user_id", "user_workspace"."workspace_id" as "pivot_workspace_id" FROM "workspaces" inner join "user_workspace" on "workspaces"."id" = "user_workspace"."workspace_id" WHERE "user_workspace"."user_id" = 51 and "workspaces"."id" = 40 LIMIT 1
---
    private function userIsFormOwner() {
        return $this->extra?->userIsOwner ??
            (
                Auth::check()
                && Auth::user()->workspaces()->find($this->workspace_id) !== null
            );