app/Http/Controllers/Forms/FormSubmissionController.php

    public function submissions(string $id)
    {
        $form = Form::findOrFail((int)$id);
        $this->authorize('view', $form);

        return FormSubmissionResource::collection($form->submissions()->paginate(100));
---
SELECT * FROM "forms" WHERE "forms"."id" = 37 and "forms"."deleted_at" IS NULL LIMIT 1
SELECT * FROM "form_submissions" WHERE "form_submissions"."form_id" = 37 and "form_submissions"."form_id" IS not NULL LIMIT 100 offset 0
SELECT count(*) as aggregate FROM "form_submissions" WHERE "form_submissions"."form_id" = 37 and "form_submissions"."form_id" IS not NULL

    public function export(string $id)
    {
        $form = Form::findOrFail((int)$id);
---
SELECT * FROM "forms" WHERE "forms"."id" = 1 and "forms"."deleted_at" IS NULL LIMIT 1