app/Http/Controllers/Forms/FormController.php

SELECT * FROM "workspaces" WHERE "workspaces"."id" = 42 LIMIT 1
---
    public function store(StoreFormRequest $request)
    {
        $this->authorize('create', Form::class);

        $workspace = Workspace::findOrFail($request->get('workspace_id'));