app/Http/Controllers/Forms/FormStatsController.php

SELECT * FROM "form_statistics" WHERE "form_statistics"."form_id" = 35 and "form_statistics"."form_id" IS not NULL and "date" > '2022-10-18 00:00:00'
SELECT count(*) as aggregate FROM "form_submissions" WHERE "form_submissions"."form_id" = 35 and "form_submissions"."form_id" IS not NULL and "created_at"::date >= '2022-11-16'
SELECT count(*) as aggregate FROM "form_views" WHERE "form_views"."form_id" = 35 and "form_views"."form_id" IS not NULL
---
    public function getFormStats(string $workspaceId, string $formId)
    {
        $form = Form::findOrFail($formId);

        $this->authorize('view', $form);

        $formStats = $form->statistics()->where('date', '>', now()->subDays(29)->startOfDay())->get();
        $periodStats = ['views' => [], 'submissions' => []];
        foreach (CarbonPeriod::create(now()->subDays(29), now()) as $dateObj) {
            $date = $dateObj->format('d-m-Y');

            $statisticData = $formStats->where('date', $dateObj->format('Y-m-d'))->first();
            $periodStats['views'][$date] = $statisticData->data['views'] ?? 0;
            $periodStats['submissions'][$date] = $statisticData->data['submissions'] ?? 0;

            if ($dateObj->toDateString() === now()->toDateString()) {
                $periodStats['views'][$date] += $form->views()->count();
                $periodStats['submissions'][$date] += $form->submissions()->whereDate('created_at', '>=', now()->startOfDay())->count();