app/Http/Controllers/Forms/FormController.php

SELECT * FROM "workspaces" WHERE "workspaces"."id" = '40' LIMIT 1
SELECT * FROM "form_submissions" WHERE "form_submissions"."form_id" in (35)
SELECT * FROM "form_views" WHERE "form_views"."form_id" in (35)
SELECT count(*) as aggregate FROM "forms" WHERE "forms"."workspace_id" = 40 and "forms"."workspace_id" IS not NULL and "forms"."deleted_at" IS NULL
---
    public function index($workspaceId)
    {
        $workspace = Workspace::findOrFail($workspaceId);
        $this->authorize('view', $workspace);
        $this->authorize('viewAny', Form::class);

        $workspaceIsPro = $workspace->is_pro;
        $forms = $workspace->forms()->with(['creator','views','submissions'])
            ->orderByDesc('updated_at')
            ->paginate(10)->through(function (Form $form) use ($workspace, $workspaceIsPro){

            // Add attributes for faster loading
            $form->extra = (object) [
                'loadedWorkspace' => $workspace,
                'workspaceIsPro' => $workspaceIsPro,
                'userIsOwner' => true,
                'cleanings' => $this->formCleaner
                    ->processForm(request(), $form)
                    ->simulateCleaning($workspace)
                    ->getPerformedCleanings()
            ];

            return $form;
        });

SELECT * FROM "workspaces" WHERE "workspaces"."id" = 40 LIMIT 1
---
    public function store(StoreFormRequest $request)
    {
        $this->authorize('create', Form::class);

        $workspace = Workspace::findOrFail($request->get('workspace_id'));

SELECT * FROM "forms" WHERE "forms"."id" = '37' and "forms"."deleted_at" IS NULL LIMIT 1
---
    public function update(UpdateFormRequest $request, string $id)
    {
        $form = Form::findOrFail($id);

SELECT * FROM "forms" WHERE "forms"."id" = '35' and "forms"."deleted_at" IS NULL LIMIT 1
---
    public function destroy($id)
    {
        $form = Form::findOrFail($id);