app/Http/Controllers/Forms/PublicFormController.php

SELECT * FROM "forms" WHERE "slug" = 'my-form' and "visibility" = 'public' and "forms"."deleted_at" IS NULL LIMIT 1
---
    public function show(Request $request, string $slug)
    {
        $form = Form::whereSlug($slug)->whereVisibility('public')->firstOrFail();

SELECT * FROM "forms" WHERE "slug" = 'my-form' and "visibility" = 'public' and "forms"."deleted_at" IS NULL LIMIT 1
SELECT * FROM "form_submissions" WHERE "form_submissions"."id" = 48 LIMIT 1
---
    public function fetchSubmission(Request $request, string $slug, string $submissionId)
    {
        $submissionId = ($submissionId) ? Hashids::decode($submissionId) : false;
        $submissionId = isset($submissionId[0]) ? $submissionId[0] : false;
        $form = Form::whereSlug($slug)->whereVisibility('public')->firstOrFail();
        if ($form->workspace == null || !$form->editable_submissions || !$submissionId) {
            return $this->error([
                'message' => 'Not allowed.',
            ]);
        }

        $submission = FormSubmission::findOrFail($submissionId);