app/Models/Forms/Form.php

    public function getSubmissionsCountAttribute()
    {
        return $this->submissions()->count();
---
SELECT count(*) as aggregate FROM "form_submissions" WHERE "form_submissions"."form_id" = 37 and "form_submissions"."form_id" IS not NULL

    public function getViewsCountAttribute()
    {
        if(env('DB_CONNECTION') == 'pgsql') {
            return $this->views()->count() +
            $this->statistics()->sum(DB::raw("cast(data->>'views' as integer)"));
---
SELECT count(*) as aggregate FROM "form_views" WHERE "form_views"."form_id" = 37 and "form_views"."form_id" IS not NULL
SELECT sum(cast(data->>'views' as integer)) as aggregate FROM "form_statistics" WHERE "form_statistics"."form_id" = 37 and "form_statistics"."form_id" IS not NULL