app/Policies/FormPolicy.php

SELECT "workspaces".*, "user_workspace"."user_id" as "pivot_user_id", "user_workspace"."workspace_id" as "pivot_workspace_id" FROM "workspaces" inner join "user_workspace" on "workspaces"."id" = "user_workspace"."workspace_id" WHERE "user_workspace"."user_id" = 51 and "workspaces"."id" = 40 LIMIT 1
---
    public function view(User $user, Form $form)
    {
        return $user->workspaces()->find($form->workspace_id)->exists();

SELECT "workspaces".*, "user_workspace"."user_id" as "pivot_user_id", "user_workspace"."workspace_id" as "pivot_workspace_id" FROM "workspaces" inner join "user_workspace" on "workspaces"."id" = "user_workspace"."workspace_id" WHERE "user_workspace"."user_id" = 51 and "workspaces"."id" = 40 LIMIT 1
---
    public function update(User $user, Form $form)
    {
        return $user->workspaces()->find($form->workspace_id)->exists();