app/Jobs/Form/StoreFormSubmissionJob.php

UPDATE "form_submissions" SET "data" = '{"90ac195b-b273-4386-9b05-5092a027cb3d":"dewd","ecbf231c-2e3e-44df-b2e4-35f52175cbc0":"julien@nahum.net","365a8b5e-acf1-453f-a5a0-fe40dc10f8c1":"dwede test julien"}', "updated_at" = '2023-01-10 13:39:38' WHERE "id" = 48
---
    private function storeSubmission(array $formData)
    {
        // Create or update record
        if ($previousSubmission = $this->submissionToUpdate()) {
            $previousSubmission->data = $formData;
            $previousSubmission->save();