app/Http/Middleware/Form/PasswordProtectedForm.php

    public function handle(Request $request, Closure $next)
    {
        if ($request->route('slug')) {
            $form = Form::where('slug',$request->route('slug'))->firstOrFail();
            $request->merge([
                'form' => $form,
            ]);
            $userIsFormOwner = Auth::check() && Auth::user()->workspaces()->find($form->workspace_id) !== null;
---
SELECT * FROM "forms" WHERE "slug" = 'my-form' and "forms"."deleted_at" IS NULL LIMIT 1
SELECT "workspaces".*, "user_workspace"."user_id" as "pivot_user_id", "user_workspace"."workspace_id" as "pivot_workspace_id" FROM "workspaces" inner join "user_workspace" on "workspaces"."id" = "user_workspace"."workspace_id" WHERE "user_workspace"."user_id" = 53 and "workspaces"."id" = 42 LIMIT 1