app/Http/Middleware/Form/ProForm.php

SELECT * FROM "forms" WHERE "forms"."id" = '35' and "forms"."deleted_at" IS NULL LIMIT 1
---
    public function handle(Request $request, Closure $next)
    {
        if ($request->route('formId') && $form = Form::findOrFail($request->route('formId'))) {