app/Http/Controllers/TemplateController.php

    public function index()
    {
        return TemplateResource::collection(Template::all());
---
SELECT * FROM "templates"