app/Models/User.php

    public function ownsWorkspace(Workspace $workspace)
    {
        return $this->workspaces()->where('workspaces.id', $workspace->id)->exists();
---
SELECT exists(SELECT * FROM "workspaces" inner join "user_workspace" on "workspaces"."id" = "user_workspace"."workspace_id" WHERE "user_workspace"."user_id" = 51 and exists (SELECT * FROM "forms" WHERE "workspaces"."id" = "forms"."workspace_id" and "forms"."deleted_at" IS NULL)) as "exists"